na_yin_dict = {
    ('甲', '子'): '海中金', ('乙', '丑'): '海中金', ('壬', '寅'): '金泊金', ('癸', '卯'): '金泊金',
    ('庚', '辰'): '白蜡金', ('辛', '巳'): '白蜡金', ('甲', '午'): '砂中金', ('乙', '未'): '砂中金',
    ('壬', '申'): '剑锋金', ('癸', '酉'): '剑锋金', ('庚', '戌'): '钗钏金', ('辛', '亥'): '钗钏金',
    ('戊', '子'): '霹雳火', ('己', '丑'): '霹雳火', ('丙', '寅'): '炉中火', ('丁', '卯'): '炉中火',
    ('甲', '辰'): '覆灯火', ('乙', '巳'): '覆灯火', ('戊', '午'): '天上火', ('己', '未'): '天上火',
    ('丙', '申'): '山下火', ('丁', '酉'): '山下火', ('甲', '戌'): '山头火', ('乙', '亥'): '山头火',
    ('壬', '子'): '桑柘木', ('癸', '丑'): '桑柘木', ('庚', '寅'): '松柏木', ('辛', '卯'): '松柏木',
    ('戊', '辰'): '大林木', ('己', '巳'): '大林木', ('壬', '午'): '杨柳木', ('癸', '未'): '杨柳木',
    ('庚', '申'): '石榴木', ('辛', '酉'): '石榴木', ('戊', '戌'): '平地木', ('己', '亥'): '平地木',
    ('庚', '子'): '壁上土', ('辛', '丑'): '壁上土', ('戊', '寅'): '城头土', ('己', '卯'): '城头土',
    ('丙', '辰'): '砂中土', ('丁', '巳'): '砂中土', ('庚', '午'): '路旁土', ('辛', '未'): '路旁土',
    ('戊', '申'): '大驿土', ('己', '酉'): '大驿土', ('丙', '戌'): '屋上土', ('丁', '亥'): '屋上土',
    ('丙', '子'): '涧下水', ('丁', '丑'): '涧下水', ('甲', '寅'): '大溪水', ('乙', '卯'): '大溪水',
    ('壬', '辰'): '长流水', ('癸', '巳'): '长流水', ('丙', '午'): '天河水', ('丁', '未'): '天河水',
    ('甲', '申'): '井泉水', ('乙', '酉'): '井泉水', ('壬', '戌'): '大海水', ('癸', '亥'): '大海水',
}

NaYin = [
    "海中金",#甲子
    "海中金",#乙丑
    "炉中火",#丙寅
    "炉中火",#丁卯
    "大林木",#戊辰
    "大林木",#己巳
    "路旁土",#庚午
    "路旁土",#辛未
    "剑风金",#壬申
    "剑风金",#癸酉
    "山头火",#甲戌
    "山头火",#乙亥
    "洞下水",#丙子
    "洞下水",#丁丑
    "城墙土",#戊寅
    "城墙土",#己卯
    "白腊金",#庚辰
    "白腊金",#辛巳
    "杨柳木",#壬午
    "杨柳木",#癸未
    "泉中水",#甲申
    "泉中水",#乙酉
    "屋上土",#丙戌
    "屋上土",#丁亥
    "霹雷火",#戊子
    "霹雷火",#己丑
    "松柏木",#庚寅
    "松柏木",#辛卯
    "长流水",#壬辰
    "长流水",#癸巳
    "沙中金",#甲午
    "沙中金",#乙未
    "山下火",#丙申
    "山下火",#丁酉
    "平地木",#戊戌
    "平地木",#己亥
    "壁上土",#庚子
    "壁上土",#辛丑
    "金箔金",#壬寅
    "金箔金",#癸卯
    "覆灯火",#甲辰
    "覆灯火",#乙巳
    "天河水",#丙午
    "天河水",#丁未
    "大泽土",#戊申
    "大泽土",#己酉
    "钗钏金",#庚戌
    "钗钏金",#辛亥
    "桑松木",#壬子
    "桑松木",#癸丑
    "大溪水",#甲寅
    "大溪水",#乙卯
    "沙中土",#丙辰
    "沙中土",#丁巳
    "天上火",#戊午
    "天上火",#己未
    "石榴木",#庚申
    "石榴木",#辛酉
    "大海水",#壬戌
    "大海水" #癸亥
]

jia_zi = [
    "甲子",
    "乙丑",
    "丙寅",
    "丁卯",
    "戊辰",
    "己巳",
    "庚午",
    "辛未",
    "壬申",
    "癸酉",
    "甲戌",
    "乙亥",
    "丙子",
    "丁丑",
    "戊寅",
    "己卯",
    "庚辰",
    "辛巳",
    "壬午",
    "癸未",
    "甲申",
    "乙酉",
    "丙戌",
    "丁亥",
    "戊子",
    "己丑",
    "庚寅",
    "辛卯",
    "壬辰",
    "癸巳",
    "甲午",
    "乙未",
    "丙申",
    "丁酉",
    "戊戌",
    "己亥",
    "庚子",
    "辛丑",
    "壬寅",
    "癸卯",
    "甲辰",
    "乙巳",
    "丙午",
    "丁未",
    "戊申",
    "己酉",
    "庚戌",
    "辛亥",
    "壬子",
    "癸丑",
    "甲寅",
    "乙卯",
    "丙辰",
    "丁巳",
    "戊午",
    "己未",
    "庚申",
    "辛酉",
    "壬戌",
    "癸亥"
]

JieQiMing = [
    '立春', '雨水',
    '惊蛰', '春分',
    '清明', '谷雨',
    '立夏', '小满',
    '芒种', '夏至',
    '小暑', '大暑',
    '立秋', '处暑',
    '白露', '秋分',
    '寒露', '霜降',
    '立冬', '小雪',
    '大雪', '冬至',
    '小寒', '大寒',
    '立春']

ArrayDunNian = [
    2,  # 甲己之年丙寅月开始
    14,  # 乙庚之年戊寅月开始
    26,  # 丙辛之年庚寅月开始
    38,  # 丁壬之年壬寅月开始
    50  # 戊癸之年甲寅月开始
];
