import pandas as pd


class TenGod:
    """
    请述财官印等之构成。
    生我者，阳见阳，或阴见阴，为枭神。阴见阳，或阳见阴，为正印。
    我生者。阳见阳，或阴见阴，为食神。阴见阳,或阳见阴,为伤官。
    克我者，阳见阳，或阴见阴，为七杀。阴见阳，或阳见阴，为正官。
    我克者。阳见阳，或阴见阴，为偏财。阴见阳，或阳见阴,为正财。
    仝我者。阳见阳,或阴见阴,为比肩。阴见阳，或阳见阴，为劫财。

    再请举例明之，我字指何物。
    我字即日干，例如甲木日干，遇丁火，甲为阳
    木，丁为阴火，甲木能生丁火，丁乃我生而阳
    见阴，即伤官也，
    又如辛金日干,遇乙木。辛为阴金，乙为阴木,
    辛金能克乙木，乙乃我克而阴见阴，即偏财也,
    特立表于后,以便检查。
    """

    def __init__(self):
        table_header = ['日干', '伤官', '食柛', '正官', '七杀', '正财', '偏财', '正印', '枭神', '劫财', '比肩']

        # 定义表数据
        table_data = [['甲', '丁', '丙', '辛', '庚', '己', '戊', '癸', '壬', '乙', '甲'],
                      ['乙', '丙', '丁', '庚', '辛', '戊', '己', '壬', '癸', '甲', '乙'],
                      ['丙', '己', '戊', '癸', '壬', '辛', '庚', '乙', '甲', '丁', '丙'],
                      ['丁', '戊', '己', '壬', '癸', '庚', '辛', '甲', '乙', '丙', '丁'],
                      ['戊', '辛', '庚', '乙', '甲', '癸', '壬', '丁', '丙', '己', '戊'],
                      ['己', '庚', '辛', '甲', '乙', '壬', '癸', '丙', '丁', '戊', '己'],
                      ['庚', '癸', '壬', '丁', '丙', '乙', '甲', '己', '戊', '辛', '庚'],
                      ['辛', '壬', '癸', '丙', '丁', '甲', '乙', '戊', '己', '庚', '辛'],
                      ['壬', '乙', '甲', '己', '戊', '丁', '丙', '辛', '庚', '癸', '壬'],
                      ['癸', '甲', '乙', '戊', '己', '丙', '丁', '庚', '辛', '壬', '癸']
                      ]

        # 构造表
        self.table = pd.DataFrame(table_data, columns=table_header)

    def __str__(self):
        return self.table.__str__()

    def getResult(self, str):
        dayTrunk = str[0]
        match = str[1]
        score = self.table.loc[(self.table['DayTrunk'] == dayTrunk) & (self.table['Match'] == match), 'Result']


if __name__ == '__main__':
    ten_god = TenGod()
    print(ten_god)
    print(ten_god.table.columns)
